app/Controllers/AdminController.php

INSERT INTO `products` (`product_name`, `category`, `description`, `stock`, `price`, `image`, `created_by`, `created_at`, `updated_at`) VALUES ('THRUWAY 25L', 'Men', 'THRUWAY 25L', '123', '129000', '1719323239_98963aef89c0ba0e6cba.jpg', '4', '2024-06-25 13:47:19', '2024-06-25 13:47:19')
---
            'updated_at' => date('Y-m-d H:i:s'),
        ];

        $productModel->insert($data);

SELECT *
FROM `products`
WHERE `products`.`id` = '5'
DELETE FROM `products`
WHERE `id` IN ('5')
---
    public function delete()
    {
        $session = session();
        $productModel = new Product();

        $id = $this->request->getPost('delete_id');

        // Pastikan produk ada sebelum menghapus
        $product = $productModel->find($id);
        if ($product) {
            // Hapus gambar dari direktori jika ada
            if ($product['image'] && file_exists(ROOTPATH . 'public/uploads/' . $product['image'])) {
                unlink(ROOTPATH . 'public/uploads/' . $product['image']);
            }

            // Hapus data produk dari database
            if ($productModel->delete($id)) {