app/Controllers/AuthController.php

    public function login()
    {
        $session = session();
        $userModel = new User();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        if (!is_string($username) || empty($username) || !is_string($password) || empty($password)) {
            $session->setFlashdata('error', 'Username atau password tidak valid');
            return redirect()->to(base_url('login'));
        }

        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1