app/Controllers/CustomerController.php

    public function viewCart()
    {
        $cartModel = new Cart();

        // Ambil semua produk dari cart berdasarkan user yang sedang login
        $products = $cartModel->select('carts.product_id, products.product_name, products.stock, products.image, products.price')
                             ->join('products', 'products.id = carts.product_id')
                             ->where('carts.created_by', session()->get('user_id'))
                             ->findAll();
---
SELECT `carts`.`product_id`, `products`.`product_name`, `products`.`stock`, `products`.`image`, `products`.`price`
FROM `carts`
JOIN `products` ON `products`.`id` = `carts`.`product_id`
WHERE `carts`.`created_by` = '3'

    public function addToCart()
    {
        $session = session();

        // Mendapatkan ID produk dari form
        $productId = $this->request->getPost('product_id');

        // Mendapatkan user_id dari session (asumsikan user sudah login)
        $userId = $session->get('user_id');

        // Buat model Cart
        $cartModel = new Cart();

        // Menambahkan produk ke keranjang
        $cartModel->insert([
            'product_id' => $productId,
            'created_by' => $userId,
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `carts` (`product_id`, `created_by`, `created_at`, `updated_at`) VALUES ('6', '3', '2024-06-25 13:47:45', '2024-06-25 13:47:45')