app/Models/Product.php

    public function getProduct($id = false)
    {
        if($id === false){
            return $this->findAll();
---
SELECT *
FROM `products`